/*
	2021.03.23
	浮点数输出说明符的格式标记。 
*/
#include <stdio.h>

int main(void){
	const double RENT =3852.999999;
	printf("*%lf*\n",RENT);
	printf("*%e*\n",RENT);
	//%e表示使用指数标记法输出。
	//输出：3.85300e+003 
	printf("*%4.2f*\n",RENT);
	//这里是保留两位小数，如果小数位长度超出指定输出长度则四舍五入为两位小数。
	//这里会输出：3853.00
	printf("*%3.1f*\n",RENT);
	printf("*%10.3f*\n",RENT);
	printf("*%10.3E*\n",RENT);
	printf("*%+4.2f*\n",RENT);
	//+表示如果值为正则在前面插入'+'，如果为负则插入'-'。 
	printf("*%010.2f*\n",RENT);
	//010.2f拆分开来理解：
	//0为标记表示在前面填充0以满足字段要求。
	//10表示字段长度为10。 
	//.2表示保留小数点后两位数字。 
	//f表示输出的值为浮点型。
	//输出：0003853.00 
	return 0;
} 
/*
Running Result:
-------------------------------- 
*3852.999999*
*3.853000e+003*
*3853.00*
*3853.0*
*  3853.000*
*3.853E+003*
*+3853.00*
*0003853.00*
-------------------------------- 
*/
