/*
	古典问题：
		有一对兔子，从出生后第3个月起每个月都生一对兔子，
		小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？
		
	实现逻辑：
		直接从第三个月循环，每过一个月兔子数量翻倍。
		 
		 
*/

#include <stdio.h>

int main(void){
	int i,f1,f2;
	f1=f2=1;
	for(i=0;i<20;i++){
		printf("%d,%d\n",f1,f2);
		f1=f1+f2;
		f2=f1+f2;
	}
	return 0;
}

/*
Running Result:
1,1
2,3
5,8
13,21
34,55
89,144
233,377
610,987
1597,2584
4181,6765
10946,17711
28657,46368
75025,121393
196418,317811
514229,832040
1346269,2178309
3524578,5702887
9227465,14930352
24157817,39088169
63245986,102334155
*/
